{
    "title": "Sparrow's Projects",
    "areas": [
        {
            "title": "The Astrology Collection",
            "summary": "Astrology is a collection of my ideas and applications",
            "description": "From small scripts to home automation and pattern recognition, I like to make life easier with my engineering knowledge.",
            "image": "sparrow/cards/NationalHarbor.jpg",
            "caption": "National Harbor, MD",
            "link": "/render/sparrow/astrology/"
        },
        {
            "title": "Bioinformatics and Medicine",
            "summary": "Exploring DNA, clinical data and medical imaging",
            "description": "Building cloud-based applications for tracking samples, clinical data, pathology images, genomic sequencing data and analysis pipelines.",
            "image": "sparrow/cards/Duke.jpg",
            "caption": "Duke University",
            "link": "/render/sparrow/projects/data/sparrow/duke/"
        },
        {
            "title": "Power Systems and Fault-Tolerant Control",
            "summary": "Moving towards a smarter grid",
            "description": "Working with NYSERDA and NYSEG, we explored the future fault diagnosis, mitigation and optimization solutions for making our electric power transmission and distribution system smarter and more reliable.",
            "image": "sparrow/cards/Vestal.jpg",
            "caption": "Vestal, NY",
            "link": ""
        },
        {
            "title": "Simulation and Modeling",
            "summary": "The first step of my research",
            "description": "Started my research with connecting distributed simulations of manufacturing system, then I moved on to building my own pedestrians simulation system with Artificial Intelligence.",
            "image": "sparrow/cards/XiAn.jpg",
            "caption": "Xi'an, China",
            "link": ""
        }

    ],
    
    "work_card": {
        "title": "At Work...",
        "description": "I worked with different people to implement reliable applications, like databases and websites. I also worked on exploratory research projects. These projects may not become applications eventually. However, they help us explore the unknown territories",
        "image": "cards/Lavender.jpg",
        "caption": "Bronx, NY",
        "events": [
            {
                "title": "Smart Grid Fault Diagnosis and Mitigation",
                "summary": "Investigated the modeling, simulation and control of electric power transmission systems, we built a hybrid simulation model to incorporate discrete events and the fluctuations on continuous states. Based on the simulation model, we designed fault diagnosis algorithm and proposed a data-driven decision making model to improve the reliability.",
                "year": "2015",
                "tags": [
                    "MATLAB",
                    "Simulink",
                    "Fault-Tolerant Control",
                    "Signal Processing",
                    "Markov Model",
                    "Optimization"
                ]
            },
            {
                "title": "Power Distribution Reliability",
                "summary": "Working with New York State Electric & Gas (NYSEG), I built simulation models to evaluate the standard indices (SAIFI, SAIDI and CAIDI). In addition, I proposed a cost-effective strategy for installing equipments with an optimization program.",
                "year": "2014",
                "tags": [
                    "MATLAB",
                    "Simulation",
                    "Optimization"
                ]
            },
            {
                "title": "Small Signal Controllability and Observability of Power Systems",
                "summary": "Power system is a non-linear complex system. However, around the normal operating point, we can develop small signal model and investigate our ability to control and observe the system. My first journey to the American Control Conference presented the idea of improving the combination of fault-tolerance, controllability and observability.",
                "year": "2013",
                "tags": [
                    "MATLAB",
                    "Simulink",
                    "Fault-Tolerant Control",
                    "Principle Component Analysis",
                    "Optimization"
                ]
            },
            {
                "title": "Access Database Development",
                "summary": "Developed Microsoft Access database with SQL, VBA and Google Maps Javascript API.",
                "year": "2012",
                "tags": [
                    "MS Access",
                    "VBA",
                    "Google Maps API",
                    "Javascript"
                ]
            },
            {
                "title": "Modeling and Simulation of Pedestrians",
                "summary": "This project integrates perception, cognitive control, path planning, reactive movement appearance and characteristics components in an agent model. With the agent-based simulation, We reproduced several self-emerge phenomena of pedestrian flows in public environment.",
                "year": "2010",
                "tags": [
                    "C++",
                    "QT",
                    "AI",
                    "Cross-Platform",
                    "Simulation"
                ]
            },
            {
                "title": "Distributed Simulation in Vehicle Manufacturing",
                "summary": "Explored the network communication protocols and data transfer between different commercial software.",
                "year": "2009",
                "tags": [
                    "C++",
                    "Simulation"
                ]
            }
        ]
    }
}